#include <iostream>
#include <Windows.h>
#include <cmath>
using namespace std;
int main()
{
    SetConsoleOutputCP(1251);
    SetConsoleCP(1251);

    /*Напишіть програму, яка обчислює суму цілих
чисел від а до 500 (значення a вводиться з клавіатури).*/


/*int a, sum = 0;
cout << "Введіть число : ";
cin >> a;
for (int i = a; i <= 500; i++)
    sum += i;
cout << "Сумма числел від" << a << " до 500 = " << sum << endl;*/

/*Завдання 2. Напишіть програму, яка запитує два цілих
числа x і y, після чого обчислює і виводить значення x у
степені y.*/

/*int x, y,res;
cout << "Введіть число х : ";
cin >> x;
cout << "Введіть число y : ";
cin >> y;

res=pow(x, y);

cout << "Число х у степені у = " <<res ;*/

/*Завдання 3. Знайти середнє арифметичне всіх цілих чисел
від 1 до 1000.*/

/*float counter = 0;
for (int i = 0; i <= 1000; i++)
    counter += i;

cout << "Середнє : " << counter/1000 << endl;*/

/*Завдання 4. Знайти здобуток усіх цілих чисел від a до 20
(значення a вводиться з клавіатури: 1 <= a <= 20).*/

/* int a, b = 1;
 cout << "введіть число а : ";
 cin >> a;
 for (int i = a; i <= 20; i++)
 {
     b = b * i;
 }
 cout << "Добуток = " << b;*/

 /*Завдання 5. Написати програму, яка виводить на екран
таблицю множення на k, де k — номер варіанта. Наприклад, для 7-го варіанта:
7 x 2 = 14;
7 x 3 = 21. */

/*int chislo1;

cout << "Введіть число 'k' ";
cin >> chislo1;

if (chislo1==1)
{
    cout << "1 x 1 = 1\n";
    cout << "1 x 2 = 2\n";
    cout << "1 x 3 = 3\n";
    cout << "1 x 4 = 4\n";
    cout << "1 x 5 = 5\n";
    cout << "1 x 6 = 6\n";
    cout << "1 x 7 = 7\n";
    cout << "1 x 8 = 8\n";
    cout << "1 x 9 = 9\n";
}
else if (chislo1==2)
{
    cout << "2 x 1 = 2\n";
    cout << "2 x 2 = 4\n";
    cout << "2 x 3 = 6\n";
    cout << "2 x 4 = 8\n";
    cout << "2 x 5 = 10\n";
    cout << "2 x 6 = 12\n";
    cout << "2 x 7 = 14\n";
    cout << "2 x 8 = 16\n";
    cout << "2 x 9 = 18\n";
}
if (chislo1==3)
{
    cout << "3 x 1 = 3\n";
    cout << "3 x 2 = 6\n";
    cout << "3 x 3 = 9\n";
    cout << "3 x 4 = 12\n";
    cout << "3 x 5 = 15\n";
    cout << "3 x 6 = 18\n";
    cout << "3 x 7 = 21\n";
    cout << "3 x 8 = 24\n";
    cout << "3 x 9 = 27\n";
}
if (chislo1==4)
{
    cout << "4 x 1 = 4\n";
    cout << "4 x 2 = 8\n";
    cout << "4 x 3 = 12\n";
    cout << "4 x 4 = 16\n";
    cout << "4 x 5 = 20\n";
    cout << "4 x 6 = 24\n";
    cout << "4 x 7 = 28\n";
    cout << "4 x 8 = 32\n";
    cout << "4 x 9 = 36\n";
}
if (chislo1==5)
{
    cout << "5 x 1 = 5\n";
    cout << "5 x 2 = 10\n";
    cout << "5 x 3 = 15\n";
    cout << "5 x 4 = 20\n";
    cout << "5 x 5 = 25\n";
    cout << "5 x 6 = 30\n";
    cout << "5 x 7 = 35\n";
    cout << "5 x 8 = 40\n";
    cout << "5 x 9 = 45\n";
}
if (chislo1==6)
{
    cout << "6 x 1 = 6\n";
    cout << "6 x 2 = 12\n";
    cout << "6 x 3 = 18\n";
    cout << "6 x 4 = 24\n";
    cout << "6 x 5 = 30\n";
    cout << "6 x 6 = 36\n";
    cout << "6 x 7 = 42\n";
    cout << "6 x 8 = 48\n";
    cout << "6 x 9 = 54\n";
}
if (chislo1==7)
{
    cout << "7 x 1 = 7\n";
    cout << "7 x 2 = 14\n";
    cout << "7 x 3 = 21\n";
    cout << "7 x 4 = 28\n";
    cout << "7 x 5 = 35\n";
    cout << "7 x 6 = 42\n";
    cout << "7 x 7 = 49\n";
    cout << "7 x 8 = 56\n";
    cout << "7 x 9 = 63\n";
}if (chislo1==8)
{
    cout << "8 x 1 = 8\n";
    cout << "8 x 2 = 16\n";
    cout << "8 x 3 = 24\n";
    cout << "8 x 4 = 32\n";
    cout << "8 x 5 = 40\n";
    cout << "8 x 6 = 48\n";
    cout << "8 x 7 = 56\n";
    cout << "8 x 8 = 64\n";
    cout << "8 x 9 = 72\n";
}
if (chislo1==9)
{
    cout << "9 x 1 = 9\n";
    cout << "9 x 2 = 18\n";
    cout << "9 x 3 = 27\n";
    cout << "9 x 4 = 36\n";
    cout << "9 x 5 = 45\n";
    cout << "9 x 6 = 54\n";
    cout << "9 x 7 = 63\n";
    cout << "9 x 8 = 72\n";
    cout << "9 x 9 = 81\n";
}*/

/*Домашнє завдання 2
Завдання 1. Підрахувати кількість цілих чисел у діапазоні
від 100 до 999, які мають дві однакові цифри.
*/


/*Завдання 2. Підрахувати кількість цілих чисел у діапазоні
від 100 до 999, у яких усі цифри різні*/



/*Завдання 3. Користувач вводить будь-яке ціле число.
Необхідно з цього цілого числа видалити всі цифри 3 і 6
і вивести назад на екран.*/
//int i = 0, a = 0, k;
//cout << "Введіть число: ";
//cin >> k;
//cout << endl;
//
//while (k > 0)
//{
//    if (k % 10 != 3 && k % 10 != 6)
//    {
//        a *= 10;
//        a += k % 10;
//    }
//    k /= 10;
//}
//
//cout << "Число =  ";
//
//while (a > 0)
//{
//    cout << a % 10;
//    a /= 10;
//}
//cout << endl << endl;

    /*Завдання 4. Користувач вводить будь-яке ціле число А.
Необхідно вивести всі цілі числа В, для яких А ділиться
без залишку на В*В і не ділиться без залишку на В*В*В.*/


/*Завдання 5. Користувач вводить ціле число А. Програма
має визначити, що куб суми цифр цього числа дорівнює
А*А.*/


/*Завдання 6. Користувач вводить ціле число. Необхідно
вивести всі цілі числа, на які задане число ділиться без
залишку.*/

//int number;
//cout << "Enter a number: ";
//cin >> number;
//cout << "Factors of " << number << ": ";
//for (int i = 1; i <= number; i++)
//{
//    if (number % i == 0)
//    {
//        cout << i << " ";
//    }
//}

    /*Завдання 7. Користувач вводить два цілих числа. Необхідно вивести всі цілі числа, на які обидва введені числа
діляться без залишку. */

//int a, b, l;
//cout << "Введіть 2 числа : ";
//cin >> a >> b;
//if (a > b)
//l = a;
//else
//l = b;
//for (int i = 1; i <= l; i++)
//if (a % i == 0 && b % i == 0)
//cout << i << endl;




}